"""
Задача 1:
Даны 2 числа a и b. Получить их сумму, разность и произведение
"""

# Ввод чисел a и b
a = float(input("Введите число a: "))
b = float(input("Введите число b: "))

# Вычисление суммы
amount = a + b

# Вычисление разности
subtraction = a - b

# Вычисление произведения
multiplication = a * b

# Вывод результатов
print("Сумма: ", amount)
print("Вычисление: ", subtraction)
print("Умножение: ", multiplication)
